app/Models/AcessoModel.php

SELECT *
FROM `acessos`
WHERE `id_visitante` = 3
AND `status` = 'ativo'
 LIMIT 1
---
    public function criarAcesso($visitante_id, $area, $id_usuario)
    {

        $ativo = $this->where('id_visitante', $visitante_id)->where('status', 'ativo')->first();